Тест1/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Клиенты</owners>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <comment>Дата договора</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <comment>Определяет валюту Расчетов по договору, не может меняться, если по договору проведен хотя бы один документ</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <comment>Дата начала действия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <comment>Дата окончания действия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>CatalogRef.дт_ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйКонтрагента</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОрганизации</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ТипыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежаВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подписан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОригинала</name>
    <type>
      <types>EnumRef.СтатусыДоговоровОригинал</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСкана</name>
    <type>
      <types>EnumRef.СтатусыДоговоровСкан</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Предоплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаПП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест1/src/Enums/ТипыДоговоров/ТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоговоров</name>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
</mdclass:Enum>

Тест1/src/Catalogs/ДоговорыКонтрагентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем") Тогда
	
		КонтрольУникальности(Отказ);
	Иначе
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидДоговора");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	
	// Установить новый уникальный номер	  
	Если НЕ ЗначениеЗаполнено(НомерДоговора) Тогда
				
		НомерДоговора = дт_ОбщегоНазначения.УникальныйНомерДоговора(ЭтотОбъект);
		
	КонецЕсли;
	
	///+ГомзяковаМА 20.02.2023
	Если Ссылка.Пустая() Тогда
		ОтветственныйМенеджер = Владелец.Ответственный;	
	КонецЕсли;
	///-ГомзяковаМА 20.02.2023
	
КонецПроцедуры





Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(НомерДоговора) Тогда
		НомерДоговора = дт_ОбщегоНазначения.УникальныйНомерДоговора(ЭтотОбъект);
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(ДатаДоговора) Тогда
		ДатаДоговора = ТекущаяДата();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Наименование = дт_ОбщегоНазначенияКлиентСервер.НаименованиеДоговора(ЭтотОбъект);
	КонецЕсли;
	
	ОтсрочкаПлатежаВДнях = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ОтсрочкаПлатежаВДнях");
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура КонтрольУникальности(Отказ)

	Если НЕ ЗначениеЗаполнено(НомерДоговора) 
		ИЛИ ПометкаУдаления Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Спр.Представление,
	|	Спр.Владелец.Представление КАК Контрагент
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Спр
	|ГДЕ
	|	Спр.Ссылка <> &Ссылка
	|	И Спр.Организация = &Организация
	|	И Спр.НомерДоговора = &НомерДоговора
	|	И НАЧАЛОПЕРИОДА(Спр.ДатаДоговора, ГОД) = &ГодДоговора
	|	И НЕ Спр.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НомерДоговора", НомерДоговора);
	Запрос.УстановитьПараметр("ГодДоговора", НачалоГода(ДатаДоговора));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Не уникальный номер договора (см.%1, %2)", Выборка.Представление, Выборка.Контрагент),
			,
			"НомерДоговора",
			,
			Отказ);
		
	КонецЕсли;

	
КонецПроцедуры // КонстрольУникальности()



#КонецОбласти

#КонецЕсли
